index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-25 Tue 09:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PySpark</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">PySpark</h1>
<p>
<a href="https://spark.apache.org/">Apache Spark</a> is an analytics engine used to process large amounts of data.  In practice I use Spark when I am working with datasets that are too large to fit in memory.  Spark allows me to perform standard data handling tasks, such as subsetting, selecting, and grouping data.  In fact, Spark even allows you to do these operations using SQL syntax.  Spark also includes common machine learning routines, such as clustering and logistic regression (see <a href="https://spark.apache.org/mllib/">MLib</a>).
</p>

<p>
You can use Spark in Java, Scala, Python, and R.  In finance you will generally use Python or R.  To use Spark from Python install the PySpark package.  Similarly in R you can install the SparkR package (though the versions on CRAN are out-of-date). In the following we'll use PySpark.
</p>

<p>
We'll use PySpark to take a look at the NYU FDIC Call Report Dataset.  
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2023-04-25 Tue 09:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
